DataProcessors/ЛБ_ВыбратьЛомбард.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЛБ_ВыбратьЛомбард</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЛБ_ТекущийЛомбардПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ТекущийЛомбардПользователя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ЛБ_ВыбратьЛомбард/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Пользователь = Пользователи.ТекущийПользователь();
	//Савранин - перенес функционал в обработку "ЛБ_АвторизацияВЛомбарде"
	Если Объект.Пользователь.ЭтоЛомбард Тогда
		Отказ = Истина;
	КонецЕсли;		
	
    Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Пользователь", Объект.Пользователь);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ТекущийЛомбардПользователя.Ломбард КАК Ломбард
	               |ИЗ
	               |	РегистрСведений.ЛБ_ТекущийЛомбардПользователя КАК ЛБ_ТекущийЛомбардПользователя
	               |ГДЕ
	               |	ЛБ_ТекущийЛомбардПользователя.Пользователь = &Пользователь"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект.Ломбард = Выборка.Ломбард;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	МенеджерЗаписи = РегистрыСведений.ЛБ_ТекущийЛомбардПользователя.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Пользователь = Объект.Пользователь;
	МенеджерЗаписи.Ломбард = Объект.Ломбард;

	МенеджерЗаписи.Записать();  
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЛомбард(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда
		Сообщить("Не выбран ломбард!");
	Иначе	
	    ЗаписатьНаСервере();
		Этаформа.Закрыть();
	КонецЕсли;
КонецПроцедуры
